[
  {"review_id":"x7mDIiDB3jEiPGPHOmDzyw","user_id":"msQe1u7Z_XuqjGoqhB0J5g","business_id":"iCQpiavjjPzJ5_3gPD5Ebg","stars":2,"date":"2011-02-25","text":"The pizza was okay. Not the best I've had. I prefer Biaggio's on Flamingo \/ Fort Apache. The chef there can make a MUCH better NY style pizza. The pizzeria @ Cosmo was over priced for the quality and lack of personality in the food. Biaggio's is a much better pick if youre going for italian - family owned, home made recipes, people that actually CARE if you like their food. You dont get that at a pizzeria in a casino. I dont care what you say...","useful":0,"funny":0,"cool":0},
{"review_id":"dDl8zu1vWPdKGihJrwQbpw","user_id":"msQe1u7Z_XuqjGoqhB0J5g","business_id":"pomGBqfbxcqPv14c3XH-ZQ","stars":5,"date":"2012-11-13","text":"I love this place! My fiance And I go here atleast once a week. The portions are huge! Food is amazing. I love their carne asada. They have great lunch specials... Leticia is super nice and cares about what you think of her restaurant. You have to try their cheese enchiladas too the sauce is different And amazing!!!","useful":0,"funny":0,"cool":0},
{"review_id":"LZp4UX5zK3e-c5ZGSeo3kA","user_id":"msQe1u7Z_XuqjGoqhB0J5g","business_id":"jtQARsP6P-LbkyjbO1qNGg","stars":1,"date":"2014-10-23","text":"Terrible. Dry corn bread. Rib tips were all fat and mushy and had no flavor. If you want bbq in this neighborhood go to john mulls roadkill grill. Trust me.","useful":3,"funny":1,"cool":1},
{"review_id":"Er4NBWCmCD4nM8_p1GRdow","user_id":"msQe1u7Z_XuqjGoqhB0J5g","business_id":"elqbBhBfElMNSrjFqW3now","stars":2,"date":"2011-02-25","text":"Back in 2005-2007 this place was my FAVORITE thai place EVER. I'd go here ALLLLL the time. I never had any complaints. Once they started to get more known and got busy, their service started to suck and their portion sizes got cut in half. I have a huge problem with paying MORE for way less food. The last time I went there I had the Pork Pad se Ew and it tasted good, but I finished my plate and was still hungry. I used to know the manager here and she would greet me with a \"Hello Melissa, nice to see you again, diet coke & pad thai or pad se ew?\" Now a days, I know she still knows me but she disregards my presence. Also, I had asked her what was up with the new portion sizes and she had no answer for me. Great food but not worth the money. I havent been back in over a year because I refuse to pay $10-15 for dinner and still be hungry after. Sorry PinKaow, you are not what you used to be!!","useful":2,"funny":0,"cool":0},
{"review_id":"jsDu6QEJHbwP2Blom1PLCA","user_id":"msQe1u7Z_XuqjGoqhB0J5g","business_id":"Ums3gaP2qM3W1XcA5r6SsQ","stars":5,"date":"2014-09-05","text":"Delicious healthy food. The steak is amazing. Fish and pork are awesome too. Service is above and beyond. Not a bad thing to say about this place. Worth every penny!","useful":0,"funny":0,"cool":0},
{"review_id":"pfavA0hr3nyqO61oupj-lA","user_id":"msQe1u7Z_XuqjGoqhB0J5g","business_id":"vgfcTvK81oD4r50NMjU2Ag","stars":1,"date":"2011-02-25","text":"This place sucks. The customer service is horrible. They dont serve food unless you order a pizza from a neighboring restaurant. Who does that? They dont control their crowd. Many times I've gone I've seen fights. The bartenders suck - I've almost got in a fight with one because she was a complete bitch. Refused to serve me a drink because she was \"busy\" celebrating her friends birthday BEHIND THE BAR. This place is ridiculous. I will NEVER go there again.. EVER.","useful":2,"funny":0,"cool":0},
{"review_id":"brokEno2n7s4vrwmmUdr9w","user_id":"msQe1u7Z_XuqjGoqhB0J5g","business_id":"AxeQEz3-s9_1TyIo-G7UQw","stars":5,"date":"2011-10-10","text":"If you like Thai food, you have to try the original thai bbq. Their pad se ew is to DIE for. Their thai egg rolls are delicious. Basil beef will not let you down (its not on the menu anymore, you have to ask for it!) \n\nYes, the building is not as fancy as some other places. Yes, i've batted a fly off my plate more than once. Yes, I do NOT go to the bathroom their because I dont even WANT to know what it looks like... \n\nBUT.. the thai food is the best in town. The service rocks. And you can get a $25 gift cert. on Restaurant.com for $2. Can you beat that? I think NOT.\n\nThis is the only place my husband and I go for anniversarys, date nights, birthdays.. anything!! I recommend it to everyone I know. If you KNOW good thai food, go here.","useful":1,"funny":0,"cool":0},
{"review_id":"kUZWBVZvhWuC8TWUg5AYyA","user_id":"msQe1u7Z_XuqjGoqhB0J5g","business_id":"zdE82PiD6wquvjYLyhOJNA","stars":5,"date":"2012-04-18","text":"AMAZING!!!\n\n I was referred here by a friend and at first thought \"Korean and Mexican?? WEIRD... i dont know\"... but my husband and I were in the area and thought why not, lets try it... after my friend had nothing but great things to say about this place. We tried the chimichanga and it was ABSOLUTELY AMAZING.... We actually did 1\/2 chicken 1\/2 beef (have you EVER been to a place that will make a burrito half and half? i havent!) The meat has fantastic flavor. I'm not a beef girl but i'd order a whole plate of their beef - its that good. The chimichanga was HUGE enough for both of us to share it (and my husband also had a beef taco which also was delicious) and we were FULL and it was $11 total with drinks. YOu cant beat that.\n\nTHe service was great. The server was so nice and attentive- you could tell she was the owner. \n\nThe only thing I'd change is their chips they serve. They were burnt, too thick and kind of bland but their salsa is great. And lets face it, i'm fat so I we ate two baskets anyway so they cant be that bad. lol\n\nAll in all, food was delicious, A LOT of food for cheap, great prices, great service great flavor. Hell even my burps taste delicious. Bahaha!","useful":0,"funny":1,"cool":0},
{"review_id":"wcqt0III88LEcm19IxFFyA","user_id":"msQe1u7Z_XuqjGoqhB0J5g","business_id":"EAwh1OmG6t6p3nRaZOW_AA","stars":4,"date":"2011-02-25","text":"Ribs = amazing\n2 hour wait time= not so amazing, but understandable. \n\nThis place would get 5 stars if they expanded their BBQ restaurant. Their ribs are AMAZING. You get SO much food for the price and it tastes sooo good. Plus, the two hour wait isnt always a bad thing because it gives you an excuse to drink and gamble while you wait!","useful":0,"funny":0,"cool":0},
{"review_id":"LWUtqzNthMM3vpWZIFBlPw","user_id":"msQe1u7Z_XuqjGoqhB0J5g","business_id":"atVh8viqTj-sqDJ35tAYVg","stars":2,"date":"2012-11-09","text":"Food is pretty good, not gonna lie. BUT you have to make sacrifices if you choose to eat there. It literally takes an hour to an hour and a half to deliver food. Seriously. EVERY SINGLE TIME. Doesnt matter if we order at 8am, 10am or 1pm. Never fails, they take F-O-R-E-V-E-R. If you dont get what you ordered or you are upset by them delivering your breakfast around LUNCH time, be ready to have the owner talk down to you and be a total bitch to you for i dont know, just wanting what you pay for?! \n\nIts over priced. But its decently tasteful food. Takes forever. Owners a witch. And i'm pretty sure that they continuing forget to pack my extra ranch just to piss me off. \n\nEnd Rant. \n\nPS- I've never gone in there to eat because i frankly, i'd rather tip the nice delivery driver then the ignorant imbeciles that work in the dining area. \n\nPPS- My hot chocolate today was cold. They should call it Cold Chocolate. Or start caring if their hot chocolate is hot. One of the two would be great!","useful":1,"funny":2,"cool":1},
{"review_id":"STiFMww2z31siPY7BWNC2g","user_id":"TlvV-xJhmh7LCwJYXkV-cg","business_id":"yFumR3CWzpfvTH2FCthvVw","stars":5,"date":"2016-06-15","text":"I have been an Emerald Club member for a number of years.  I have always been very satisfied with their vehicles and customer service.  This recent visit to Pittsburgh was no exception.","useful":0,"funny":0,"cool":0},
{"review_id":"HkYqGb0Gplmmk-xlHTRBoA","user_id":"NhOc64RsrTT1Dls50yYW8g","business_id":"UBv8heCQR0RPnUQG0zkXIQ","stars":1,"date":"2016-09-23","text":"The score should be negative. Its HORRIBLE. The have like 6-7 items in their buffet. No naans or salad. The items were either bland or stale. My friend had a potato curry which was completely stale without salt. The biriyani was okayish but bland. Would never recommend to anyone.","useful":0,"funny":0,"cool":0},
{"review_id":"RgqWdZA4xR023iP3T6jVfA","user_id":"NhOc64RsrTT1Dls50yYW8g","business_id":"hdgYnadxg0GANhWOJabr2g","stars":5,"date":"2014-08-23","text":"I went there twice and I am pretty happy with my haircut. The people are  really friendly. Would definitely go again.","useful":0,"funny":0,"cool":0},
{"review_id":"-STQDcMcBcWX0H_NrsfR2Q","user_id":"LKcdcMrq2xDzIThSHiZmLg","business_id":"yEOu75XjwczngvWWlr0M_A","stars":4,"date":"2016-02-17","text":"Great for the price, only $25 for long hair! Was hesitant about dry cut but it turned out good!","useful":1,"funny":0,"cool":0},
{"review_id":"kS4hrhEScwB9V5JATYjvVQ","user_id":"hxqo4NyJFfeOmuoVi--s1A","business_id":"f5O7v_X_jCg2itqacRfxhg","stars":5,"date":"2017-10-12","text":"Sansotei serves some top notch ramen. They take no reservations, so my company of five had to wait outside for about half an hour. I guess it's normal for Saturday night. Unlike my favorite ramen place in NYC you can only order what's on a menu. No deviations or improvisations whatsoever. Our waitress didn't speak much English, and even after writing everything down still managed to make a mistake or two. But, my spicy sesame ramen called Tan Tan was exceptional. I can tell you that. Just the right thickness of broth, and taste - omg.","useful":0,"funny":0,"cool":0},
{"review_id":"5um5SX-Lbgik5dwUGe2jFw","user_id":"eG6HneK9zLcuZpVuKcsCGQ","business_id":"XqNDr54eLDLRfZwo4l4dVA","stars":4,"date":"2015-09-22","text":"Of the several places to get bagels in Oakland, these bagels are the best. Really fresh and tasty and they taste homemade.\n\nHowever, I wasn't crazy about their bagel and egg sandwiches.","useful":0,"funny":0,"cool":0},
{"review_id":"VKGvSe0SmYcFc5PqjbxLDQ","user_id":"eG6HneK9zLcuZpVuKcsCGQ","business_id":"0bjFYstj8USMzEV4ZQldjA","stars":5,"date":"2017-01-19","text":"Cool little place, nice atmosphere and staff. Great coffee too, go check em out!","useful":0,"funny":0,"cool":0},
{"review_id":"M9gD64U797dfIpLA9OHYVA","user_id":"eG6HneK9zLcuZpVuKcsCGQ","business_id":"q0n4I-zqiI47xispOqc1lA","stars":5,"date":"2016-09-19","text":"Delicious, friendly staff, cool atmosphere, all around great experience! They have a pretty great selection of crepes and omelettes, among other things. I enjoyed the Cherry Omelette (cherry tomatoes, swiss cheese, potato slices, and bacon) which was pretty big and cooked perfectly! Nice side salad and bread as well. Coffee was great and our server was warm and polite. Would recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"eShfPWENUmZ9sP7fstPt7Q","user_id":"eG6HneK9zLcuZpVuKcsCGQ","business_id":"alG1fb1kl2vmT8s34jbbHg","stars":5,"date":"2015-09-05","text":"Great haircut, cool atmosphere, and really nice people! The price is fair and he is very thorough. Really listens to what you want. Also, I recommend calling ahead to see if it is busy. Worked for me!","useful":1,"funny":1,"cool":1},
{"review_id":"51RHs_V_fjuistnuKxNpEg","user_id":"5ngpW5tf3ep680eG1HxHzA","business_id":"gZGsReG0VeX4uKViHTB9EQ","stars":5,"date":"2017-08-16","text":"Finally! After trying many Mexican restaurants all thru Phoenix & Scottsdale we found an authentic Mexican restaurant that was AMAZING! Fresh tortilla chip & salsa ready and waiting at the table when we sat down. Food was incredible! I ordered the combo with a beef tamale with red sauce & chicken enchilada. Both were full of meat from beginning to end & had so much flavor! Highly recommend this place","useful":0,"funny":0,"cool":0},
{"review_id":"P7kiSTiwzqm0_LbA71EOPg","user_id":"5ngpW5tf3ep680eG1HxHzA","business_id":"-bd4BQcl1ekgo7avaFngIw","stars":5,"date":"2017-06-28","text":"One of the best breakfast places I've been to! The menu had so many options, above & beyond your typical breakfast choices. Portions were HUGE and everything was delicious & so fresh! Will definitely be back & highly recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"7EgEjUpcb8q-B5dPCMvkaQ","user_id":"5ngpW5tf3ep680eG1HxHzA","business_id":"u73j2VQ3TGWdMO-AG7MABw","stars":2,"date":"2017-07-06","text":"Food was alright, the service was HORRIBLE! Both of our orders came out incorrect after waiting extremely long because they don't write anything down when they take the orders. I asked for greens at the end she confirmed did you say grits? I said no greens please.. still ended up with grits. Boyfriends whole order came out wrong and when they brought him back the right order pretty sure they brought out my grits they took back 5 min before from my wrong order and gave them to him. Waitress came back and just set the plate down and walked off. No sorry about that, does it look right now, do you need anything else.. just straight nothing. Never came by our whole meal to check on us.","useful":1,"funny":0,"cool":0},
{"review_id":"F1UHGw4-6OYyvFFb-E4LMg","user_id":"5ngpW5tf3ep680eG1HxHzA","business_id":"VyVIneSU7XAWgMBllI6LnQ","stars":5,"date":"2017-07-08","text":"DELICIOUS! forgot to take a before picture but as you can see it was amazing. We got 2 kinds of ribs, brisket & chicken and literally every single one fell straight off the bone! Sides were all good. Cornbread before & sugar donuts after. Will definitely be back.","useful":0,"funny":0,"cool":0},
{"review_id":"MTrzrLQT_LK2VLK9xantHw","user_id":"eAavwM32i2h7sNNer--kGw","business_id":"3Mx4renubPRnjHUw1n2UkA","stars":1,"date":"2015-09-30","text":"If I could leave zero stars I would. This rude B at the door with the fake lashes and colored lens was super rude. We had entered the club earlier and upon leaving the guy at the door told us we could come back later for the show. But when we came back, one man let us through up to the door, but the B there said there was no re-entry. She then proceeded to tell us that we could talk to \"the guy by the exit\". Okay. Well FYI, if you've never been to a venue, you don't know exactly where everything is. We walked away and looked around and weren't sure where she was referring to so we went back and asked where the exit was. She rudely responded, \"I SAID. Go see the guy by the exit OVER THERE.\"  Felicia. \n\nBasically everyone was rude. Not coming back.","useful":4,"funny":1,"cool":0},
{"review_id":"3KaBIsNiqbpLkm3-WaLRyA","user_id":"64_BcjX0f6hQceeKeTw0Ag","business_id":"k2b3niokS_tosjah_rzCPw","stars":2,"date":"2013-11-19","text":"I live literally walking distance from this eatery. My husband and I decided to order a large pizza to go. ALMOST $30 for a large pizza?!?!? Are you kidding me? The pizza was good but nothing out of the ordinary....$5 Hot N Readys from now on....","useful":3,"funny":2,"cool":0},
{"review_id":"a8SlkIxIYUwAJcKp71jqwQ","user_id":"AKlB7DQTllN8ZlF_iSUvTA","business_id":"qSa3L7cy8Gju4ZLs50ycag","stars":2,"date":"2014-07-23","text":"One step above McDonalds Fish.. If you like fried seafood that all tastes the same and dripping with grease this is the place for you. The inside is rather nasty looking and the enviornment is loud! Not recommended unless you like big portions of fried fish mush.","useful":0,"funny":1,"cool":0},
{"review_id":"O3C6QS9obf9d1SIiQoOySQ","user_id":"AKlB7DQTllN8ZlF_iSUvTA","business_id":"vUelO4_KmsSjAxA_eKGdPQ","stars":5,"date":"2014-07-25","text":"Order from here regularly and get consitently fast service and quality food","useful":1,"funny":1,"cool":0},
{"review_id":"-kC7KwIZbSPFZs3NEwXgpw","user_id":"AKlB7DQTllN8ZlF_iSUvTA","business_id":"lQ7nCHL5iopvoDdSSYwKnQ","stars":5,"date":"2014-07-25","text":"Always fresh food, easy to find items, helpfull staff and FAST checkout. Love me some Publix...","useful":0,"funny":0,"cool":0},
{"review_id":"b-yRK9dPllM4q_ME213Y-g","user_id":"AKlB7DQTllN8ZlF_iSUvTA","business_id":"ASes0f6vfjqD3iieIX5BFQ","stars":5,"date":"2014-07-21","text":"I've been to a couple of chiropractors in the Ft Mill area and by far I like Dr. Williams the best. He listens, takes good notes and changes the therapy if something does not have the desired result the first time. I like manual adjustments so Doc Williams is for me.. I've been going here for over a year and alwayse get relief after my visit. Oh yeah let me also mention I can normally get in very quickly and virtually NO WAIT which is very important to me.","useful":2,"funny":0,"cool":0},
{"review_id":"PcqUWeKKxs-ilHhoAKDHZg","user_id":"AKlB7DQTllN8ZlF_iSUvTA","business_id":"7OGeyChB5kvdWQWoHYGN2A","stars":5,"date":"2014-07-21","text":"I have been seeing Christine for the past couple months to work out some back issues and I am getting great results.","useful":0,"funny":0,"cool":0},
{"review_id":"fZ-wbOJQolGkBWr96znCng","user_id":"AKlB7DQTllN8ZlF_iSUvTA","business_id":"_4vjkw-LjpqQyxU4rHtwBA","stars":5,"date":"2014-07-21","text":"Get a family membership every year to the Greenway. It's always fun day with no TV and real family time. Have camped here a couple time as well and that was a blast. My son caught his first fish in the lake and that made for another great memory. We get family pictures taken here every year and love the trails too. Nothing but good things to say about the greenway","useful":0,"funny":0,"cool":0},
{"review_id":"XbRpVIT1om5flSZV_2GtBg","user_id":"AKlB7DQTllN8ZlF_iSUvTA","business_id":"Jxi4Jb7yp-QfYUeUaXaYKQ","stars":5,"date":"2014-07-23","text":"Loved it! Great for date night and experiencing new foods cooked to perfection.","useful":0,"funny":0,"cool":0},
{"review_id":"A5W9Te_oCycovxxN4KcnHw","user_id":"yv5v94CbbuqkbwKXwPrJ7A","business_id":"2zBCxn7_jHcfxoSjBdHJ3A","stars":5,"date":"2014-08-25","text":"Breadcrafters! What is this??  If you don't know, then come check this place out!!  This place is so amazing to come eat breakfast, lunch, and even for dinner if you wanna just come and grab it... come in and indulge your self with some homemade luv'n cookn' especially their breads, and omgoodness,  the is Santa Fe breakfast burrito, is da bomb, everything is all fresh and homemade!  Their salads, their soups, their desserts, organic teas..... i have not been disappointed yet, so if you do not have time to enjoy.... then call in your order for pick up or call in for catering and they will cater to you!   If you do not have time during week days then come out on the weekends, a guarantee to your satisfaction! !  Right across from PV Mall, SE side of Larkspur and Tatum, literally across from Wendy's, the not so healthy foods!","useful":0,"funny":0,"cool":0},
{"review_id":"_vrt96ajcreRASj6s0JqXA","user_id":"ZcAi2ddbQyAhgta4VfxM2A","business_id":"Yqg9Muttvbm9s2r-HZY18Q","stars":5,"date":"2017-02-03","text":"We love Capriotti's! My husband and I love the Bobby, but my kids are fans of the meatball.  It can be a bit pricey for our large family of 7 to each have their own sub, so we buy 3 large (20 inch) subs to split.  It's plenty of food and we are all able to try a taste of several different sandwiches instead of being limited to one.  Definitely one of the best sub restaurants in the valley.","useful":0,"funny":0,"cool":0},
{"review_id":"dFnPptjMvHGaIkrH7w-KaA","user_id":"ZcAi2ddbQyAhgta4VfxM2A","business_id":"PJ-VbAtIOso1dqd2frQqqg","stars":5,"date":"2016-09-28","text":"These are the best donuts in Las Vegas. Don't waste your time with the big chains that over charge. I drive over 20 minutes to get these as opposed to the chain that is just down the street.  They're wonderful any time of the day, but they're especially good at about 8 pm when they are fresh.","useful":0,"funny":0,"cool":0},
{"review_id":"xz5yzPCOB-TGL4H6fqq4-g","user_id":"ZcAi2ddbQyAhgta4VfxM2A","business_id":"wKA2y-F_fPcBDOkpzDB9eQ","stars":5,"date":"2015-02-08","text":"This was definitely not a restaurant I would have tried had I not read the reviews on yelp first.  It's not in the best neighborhood and looks rundown from the outside.  I have now learned that appearances mean nothing.   The food was fantastic, and that's coming from someone who is not a big fan of Mexican food. \n\nI had the tacos design Carne Asada and they were wonderful. The meat was so tender it melts in your mouth.  Add that to homemade tortillas and tortilla chips, and you can't go wrong.","useful":1,"funny":0,"cool":0},
{"review_id":"f5akaDNCN3gOwA06k_-eUg","user_id":"ZcAi2ddbQyAhgta4VfxM2A","business_id":"0OdZXIKQypu6vplpxFilsA","stars":5,"date":"2017-02-04","text":"Love Kneaders! Their sandwiches are huge and their desserts are really good. If you haven't tried the raspberry bread pudding, it's a must.  This is one if those places like Panera that are great because they're a step above the typical fast food, but more casual and faster than an actual sit down restaurant.","useful":0,"funny":0,"cool":0},
{"review_id":"ZA72EQg11CGo9fboRS00aw","user_id":"ZcAi2ddbQyAhgta4VfxM2A","business_id":"eMKqAItLbazgUT8xokz7fw","stars":5,"date":"2015-02-08","text":"Simply the best dining experience I've ever had. The waiter was extremely friendly.  The food was exceptional and came in huge portions.  At the end, the chef came out and asked how our meal was and if we would return.  We answered yes without hesitation.","useful":0,"funny":0,"cool":0},
{"review_id":"ZEI4Kdy2YXJg4R6Wx4pyNw","user_id":"jaJGA7iBSqGNAak4dazaqA","business_id":"P-PGXd2JJEMqJoIWJhD_iw","stars":1,"date":"2016-04-01","text":"I booked a massage using a Groupon for Green Tree Health and Massage. A week later I got a voicemail asking me to confirm my appointment time for 7:30 am. The person who left the message told me I could text a certain number, so I did. I wrote that I would be there at 7:30 and the person wrote back \"Great. Thanks.\" and that was the end of our communication. A little strange, I thought, to be dealing with a massage therapist I have never met by text, but I knew it was a small business so didn't get it too much mind. Never did the person I was booking with tell me to arrive early or be there by a certain time. I live a minute away from this business & arrived at 7:30 (when I went by the place earlier no cars were in the parking lot & the building was dark) and started filing out my paperwork. No one came out to meet me for at least 3 minutes. When the owner did come out, she gave me a funny look & I had to introduce myself. I asked her if she was expecting me because she looked surprised to see me. She said \"No, but now I'm running late.\" and proceeded to give me weird looks as I filled out my paper work. She never once asked how I was doing, what I was hoping to get out of the experience, or even my name. I told her that I was picking up some strange vibes and asked if she wanted me to leave. She said, \"Have you ever had a massage before?\" and when I told her it had been a few years she yelled at me saying \"You're suppose to be on the table at 7:30. (My appointment time). I pointed out that she never once told me to arrive by a certain time and that when I had driven by the place no one was in the parking lot. I explained why I was feeling weird: the looks, the questions, the fact that she never gave me directions for arriving, etc. And asked if she wanted me to leave. She at first said no, but then proceeded to say \"You know what. I can pick and choose who I want to work with. And I'm not feeling that this is right. You can leave.\" So I asked for my money back. She said I could ask Groupon for it and then said that she doesn't care because she only gets $10 from those transactions and that she has hundreds of clients. I I told her that I was hoping to be a long-term client because I have severe back issues and stress and she told me she didn't care. I made a comment of not being able to find any reviews on her place, she told me that Groupon was having technical issues and that's why but all of her reviews \"are good.\" I left and as I was walking down the hallway, she opened her door and started yelling at me again saying \"You can't write reviews for me because you're not a customer!\" Perhaps the owner has been in business for 13 years, as she told me this morning, but her customer service is severely lacking and she does not seem to be open to wanting any new business either. When going to a Health & Wellness place I expect to be treated kindly and not be given the stink eye immediately upon entering. If I had been given information about when and how to arrive I would arrived at the appointed time. I also would have been more sympathetic to her case, but I never given such. She also had my cell phone number and could have easily called (or texted as she prefers) to see where I was when I did arrive at the time she had pictured in her head. Instead, I was yelled at, given terrible looks, and made to feel like a bad person because I wanted to try massage therapy for my health issues and stress. In general, from booking and the texting confirmation of my appointment, I found the whole experience to be terrible and completely unprofessional. I will not be going back and would never recommend this place to a stranger or friend. There are plenty of places who will welcome new business, but this is not it. Stay away, stay far far away.","useful":19,"funny":3,"cool":1},
{"review_id":"SY4JQ7LzZeWZ9jTSeN1fZA","user_id":"mcZgWtmeuuGpLDEOZIu68g","business_id":"DkYS3arLOhA8si5uUEmHOw","stars":5,"date":"2013-01-15","text":"I've literally driven to Vegas (4 hour drive) just for this. \n\nCheap, amazing, simple, nuff said.\n\nGet the original. Thank me later. Don't mess with anything else, unless you've had the original at LEAST 10 times (i am not exaggerating). If anybody tells you anything different, tell them to \"Shut their mouth when they're talkin to you\". Perfect food for every situation and you will encounter EVERY situation in Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"VtUUs79S1F986TwJfu5SLQ","user_id":"gN4E2oEOm196poOzAJ13CA","business_id":"woP-omtF0PobX4JxXpZa7Q","stars":4,"date":"2016-06-14","text":"Great place for breakast that feels like home, with a big variety on the menu. P.s. the French toast was fantastic!","useful":5,"funny":0,"cool":1},
{"review_id":"aBuQ701St8N0ztxsrt3rgw","user_id":"C4twz5ReAYyoDBpHa7n29A","business_id":"d-wvSnFt6JAZBzqMiGpvyQ","stars":1,"date":"2013-09-30","text":"Pizza was burnt and clearly warmed up with some more cheese thrown on top.  Won't go back.","useful":0,"funny":1,"cool":0},
{"review_id":"EnF87T_XYdAX3Z_rEN-ezg","user_id":"C4twz5ReAYyoDBpHa7n29A","business_id":"uOwFSgT60fhrXClZFvePkg","stars":1,"date":"2014-10-24","text":"I would NOT recommend this company.  The whole process took 5 months, I had to send them the same documents over and over, finally the lending head had to get involved and things got a little better.  Finally they called me one day and said that they needed to close THAT day (I was in NYC for business).  This is after they had to change closing costs many times, find a new lender because they lost the rate lock, and on and on...","useful":21,"funny":0,"cool":0},
{"review_id":"uq_WYU4vUMflEqATGUyocQ","user_id":"cMHyRErCSW_QjEfAd_koBw","business_id":"o9IvrLWtTt5lCYqO-uiJLg","stars":1,"date":"2016-03-28","text":"Big email promotion about MSNBC being there election night but they didn't bother to email again when it was cancelled - cute trick.  The beef ribs were the worst ever.  Three huge bones with next to no meat at all and what there was could not have been tougher. Based upon our experience, GROSSLY over-rated.","useful":2,"funny":3,"cool":0},
{"review_id":"s_IZFRJsv8ni2xcTGruEJg","user_id":"vsxstz8B5z4LYG9wU2IgTg","business_id":"wzugmCevnXuCMCF4upAf0w","stars":4,"date":"2013-10-12","text":"This place is delicious and great if you are willing to wait in a long line. Food was excellent, I had the tuna-salmon bowl as an entree and the homemade tofu appetizer, would highly recommend both. The only reason I gave 4 stars was because of the long wait and the atmosphere - it is a very tiny, cramped restaurant, you are practically on top of the people sitting on either side. Extremely loud too. The food is so good that I understand why people are willing to wait outside 30-45 minutes.","useful":1,"funny":0,"cool":0},
{"review_id":"Fc0Biz228WcwRsXtgVTiLA","user_id":"vsxstz8B5z4LYG9wU2IgTg","business_id":"3JDGOc2pz2nn9D4s4f6_zg","stars":4,"date":"2013-10-12","text":"Excellent service, our waiter was very friendly. I had a strawberry banana crepe and my boyfriend had a mushroom cheese crepe, both were delicious. Cute inside upstairs. Also beer and wine available. I was not, however, impressed by the bird flying around inside, landing on the tables and such.","useful":0,"funny":0,"cool":1},
{"review_id":"bw5sv2eXmfgDlJiEGJflXw","user_id":"Y6hr7IPgqKBNaCoN9Uyffg","business_id":"quD839G-_0HIwAIE0knV6g","stars":1,"date":"2009-02-03","text":"Beware of having to buy additional car insurance. The counter person spoke about \"wreckless and drunk drivers\" and how your insurance policy will not cover damages and fee's. \n\nI'am filing compliant with the Nevada state AG - Consumer Protection. the local Better Business Bureau. \n\nCheck back for further details regarding this and check Craigslist as well.","useful":1,"funny":0,"cool":0},
{"review_id":"4v3T3MI19ZP_tZdt5rUq5Q","user_id":"OaminlAYF6A2Cn0GG4IuOA","business_id":"N58CiJxvwAVD8zUG2oMWvA","stars":5,"date":"2017-03-11","text":"Started with them about a month ago as I'm working swings now and didn't want to have to go out to eat every night. Also was looking for something healthier then what my previous diet consisted of. I really like the wide variety of meals they have and haven't came across one I haven't liked yet! Very convenient for me as I don't have much time during the week to cook and prep meals. Plus if you do that your eating the same meals constantly which would get old quick. I've had an incident with the delivery but nothing major and they more then made it up to me! If you don't want to deal with grocery shopping, cooking, cleaning, and prepping, I suggest you place an order with these guys! I'm happy with my choice of fit prep for my meal prep provider.","useful":1,"funny":0,"cool":0},
{"review_id":"f9rUD986w2KKfegB1NY-RA","user_id":"OaminlAYF6A2Cn0GG4IuOA","business_id":"HyoPFfBHLK0lKVHWEdFpvQ","stars":5,"date":"2017-04-07","text":"Excellent food! Some of the best Chinese I've had in awhile to be honest. Close to work so I hit it up semi-regularly. Mongolian beef is on point!","useful":2,"funny":0,"cool":0},
{"review_id":"f906Z01W9EnoJnPAddvsMA","user_id":"5Be0AugCu2aEizTR6sK1ug","business_id":"p-w6g8cuQq5PU_4U1XNCzQ","stars":1,"date":"2015-11-19","text":"this place doesn't even deserve a star period. food comes very skimpy, prices are way too high for what they serve you, tacos were weak, burrito wasn't even a burrito just tortilla with meat. horrible place to come, you should come here if you want to WASTE your money and time","useful":0,"funny":0,"cool":0},
{"review_id":"OZn2_OkiIm_S8nof0mbkVw","user_id":"jNDg4FQjayH0Hzg82uygjg","business_id":"1ru9ZnIcSXKtD-jQoxLzNg","stars":5,"date":"2016-03-14","text":"My wife and I are delighted with Freiburg.  Great food! Great service (thanks Ashleigh!). Amazing beer in the best atmosphere we've enjoyed in Madison for a good long time. Maybe ever. If you are vegetarian you can make a meal from the excellent sides, soups, and salads.  We'll be back for the fish fry for sure.","useful":0,"funny":0,"cool":1},
{"review_id":"Ulafb6FWN4s8BFMaIbY-UQ","user_id":"jNDg4FQjayH0Hzg82uygjg","business_id":"R6QCy5sVlySKgqvHb-HhTg","stars":1,"date":"2015-02-08","text":"Have had beers on occasion and been disappointed by the the unreliability of the selection.  Joined friends for dinner to experience the dining and were told shortly after finishing dinner that we had to leave. I quote, \"it's a small place\".  We won't be back for any reason. Suggest another venue to meet friends. Food was mediocre and service sub-par.","useful":0,"funny":0,"cool":0},
{"review_id":"IzwT_wEhb5AmmJwVcEM12w","user_id":"jNDg4FQjayH0Hzg82uygjg","business_id":"B2KSgKekQfeOFHWH7g68Tg","stars":1,"date":"2014-01-11","text":"We tried this for lunch on a Saturday. We were the first people to arrive for lunch a little after 11 AM. The server didn't mention the specials...we saw them on the way out. We ordered appetizers that appeared to be reheated a bit, they were not hot or very warm at all. The soup was brought out while we were eating our appetizers, shortly afterward the entrees were brought out while we were still eating our appetizers. The lamb masala had good flavor for left overs. The same for my wife's vegetable vindaloo. Naan is an extra charge, soup  is included. All in all, clueless service as far as normal meal service goes (but polite). Reheated food passed off as made to order. For  a $31 lunch I would rather check out a buffet for $10 less for two people.","useful":3,"funny":0,"cool":0},
{"review_id":"gnfeoI2tcfNLSZo9HyXcpA","user_id":"jNDg4FQjayH0Hzg82uygjg","business_id":"uC3qwaxsOkdJzpOc0v1Mog","stars":2,"date":"2015-10-26","text":"Stopped to check things out after brunch and try a few beers.  Loud music probably intentional to keep people moving through rather than hanging out. I expected more all the way around. Taps were way overpriced for the size of the pour (both beer and wine), didn't eat but didn't see or smell anything that looked worth the prices. The bar was cluttered, not obviously clean, and had 6 bartenders milling about. Observed food en route to a table get passed 3 times from server to server then held during 10 minute conversation before getting delivered. Bar staff appear to be a few folks from another local place with unfriendly service if not a regular, seems similar already at Hollander. Won't be back. Seems like another contrived restaurant trying to lure people with themes and gimmicks rather than quality product and service.","useful":0,"funny":0,"cool":0},
{"review_id":"l201aLBqN3pXQs7s0uDAFg","user_id":"jNDg4FQjayH0Hzg82uygjg","business_id":"_j0xNyOAtLI7iRF4GStBgA","stars":5,"date":"2015-04-16","text":"There are challenges in Madison finding a coffee shop with really good coffee, clean atmosphere, and attentive staff. The cafe at Metcalfe's suffers none of these.  The staff is great, the coffee (True coffee roasters), is better brewed than that of True coffee locations (especially the one in Fitchburg). They also have tea and a tons of other specialty beverages I don't drink but maybe I'll expand my palate some day. Pete does a great job leading things and it's obvious he has a personal commitment to his work.","useful":1,"funny":0,"cool":0},
{"review_id":"rGZj9SrRNOB0agkpbrsTMA","user_id":"jNDg4FQjayH0Hzg82uygjg","business_id":"t67GMPZ0cv_ItKlID-JFiQ","stars":5,"date":"2015-04-16","text":"Have only dined at the food cart downtown.  I love falafel and used to make my own but now I only eat Banzo and have seriously had to try not to do it every day. Great food and service for a reasonable price.","useful":1,"funny":0,"cool":1},
{"review_id":"Ng9N7wAec8hwFPF7-Xfmjg","user_id":"jNDg4FQjayH0Hzg82uygjg","business_id":"M-caugKzJ9qLOmCBfD9Nyg","stars":1,"date":"2014-01-12","text":"I had breakfast one morning on a whim. I ordered an omelet that came with some peppers and onions with potatoes on the side. The ingredients were not cooked and were still refrigerator cold. The omelet was barely warm. The coffee was bitter and over-extracted due to using far to little grounds for the brew. Probably the day before's batch. Service was an after-thought by someone wrapping flatware with napkins. I won't be back and couldn't recommend to anyone.","useful":0,"funny":0,"cool":0},
{"review_id":"MnhJbpABJyN21cLkEOwIng","user_id":"jNDg4FQjayH0Hzg82uygjg","business_id":"3-HFGxmbzSax-NySJ_LzDg","stars":1,"date":"2016-03-27","text":"My wife and I ate at VIP on a Sunday. She tried the all you can eat sushi and I had the assorted vegetables.  The vegetables were still partially frozen (obviously from a large bag) and cooked in a very oily sauce that was borderline rancid. The sushi is low quality and the service in between servings is ridiculously slow! sparse, and incomplete. We won't be back and recommend Red Sushi for sushi and Ha Long Bay for anything vegetable-based. The compromise on atmosphere is well worth it for the much higher level of food in either case. We won't be back to VIP and recommend others avoid it.","useful":0,"funny":0,"cool":0},
{"review_id":"kKvUYPkMJLFvOsT24qwTew","user_id":"jNDg4FQjayH0Hzg82uygjg","business_id":"oKYUMYQI7AkjCJdRsKlqtg","stars":1,"date":"2015-04-16","text":"Have come here for years and observed a steady decline. The service is really becoming poor as the better folks have moved on. The sushi is nothing special. No presentation beyond grocery store sushi on a plate. Duct tape to keep the furniture together that badly needs replacement. Seems like they just don't care anymore. And neither do I to return.","useful":3,"funny":1,"cool":0},
{"review_id":"cy2vrH6AyYuZJUDKEr4m4g","user_id":"8TkBbx5eCEdp1_-rfnQDKw","business_id":"O1J2zf-IGDxDig8WifUSrg","stars":5,"date":"2017-03-22","text":"Got my windshield replaced at an awesome cost. Awesome & quick service.  Will definitely refer family & friends.","useful":0,"funny":0,"cool":0},
{"review_id":"xGSstn3-lVbxc75FPfvQmQ","user_id":"Wpr_EbRY9ABBnqrHS0Ad2A","business_id":"CoGcHxwZNwG3gdMJey_UXQ","stars":5,"date":"2014-04-05","text":"I have been looking for a hair salon in the LV area and FINALLY found one! B2B is a great place - but KATHY IS AMAZING. She is a great stylist, professional and really friendly.  I'm so impressed with her. She is the BEST!","useful":0,"funny":0,"cool":0},
{"review_id":"WE9yFMRL_7tj-IIEp-hNdQ","user_id":"Wpr_EbRY9ABBnqrHS0Ad2A","business_id":"KGDKa42EVVFOvdgDahBApw","stars":5,"date":"2015-09-12","text":"ELLICE is amazing - she just knows what I want every single time!!! Color, cut, blowout - she is the expert!","useful":0,"funny":0,"cool":0},
{"review_id":"7t2o7McUh1lcW1mu0-8EGw","user_id":"Wpr_EbRY9ABBnqrHS0Ad2A","business_id":"-FcZY7a7qgxTUlTvwuyJnQ","stars":1,"date":"2015-02-05","text":"First off, I am not rating the food at all.  The food is 5 star, pretty excellent.  I always get the signature fried rice and the shrimp toast and it is pretty spectacular.  This review is for the customer service ONLY - WHICH IS ONLY GIVING A HALF STAR - LUCKY FOR THIS RESTAURANT THAT YELP WONT ALLOW JUST HALF A STAR.\n\nI have been here 5 times, and the first time was the ONLY time that I got good (not great) customer service.  Since the first time was good, I brought my husband my next go round.  TOTAL fail on the customer service - they put out the entree BEFORE the appetizers and they did not bring both entrees as the same time either.  I asked to talk to a manager - the manager said that he will email management - GUESS WHAT - I never heard anything back.  This place is totally mismanaged.  The third time I was here alone for early dinner so I just sat at the bar.  I timed it - it took them 7 minutes just to get me a soda, and another 18 minutes just to get my signature fried rice.  Mind you, the place was not crowded. Did I mention that this place is mismanaged?  Just making sure.  Since the food is soooo good, I keep giving this place a chance.  My fourth visit I just got food to go - so I guess it wasnt bad since I didnt have to endure the poor customer service.  The last time was the funniest - I was there again for early dinner (like 5ish) so there was barely no one here - maybe 10 customers total.  I am sitting at the bar just waiting for my food - this couple walks up the hostess' bar.  GUESS WHAT - they wait there - I kid you not - for 10 minutes to be seated.  Guess what the hostess was doing?  Clearing tables and serving food.  The management needs to know about the poor customer service that this place has.  I mean, its at the red rock - one of the best hotels in Las Vegas and they have this?  THEY NEED TO REDO THEIR CUSTOMER TRAINING -MANAGEMENT NEEDS TO LOOK INTO THIS!!!!!!","useful":7,"funny":3,"cool":0},
{"review_id":"y-jgNysxfvBS6U7Ahn0-0w","user_id":"Wpr_EbRY9ABBnqrHS0Ad2A","business_id":"ILCRrpBIp8KTknEdgIpTxw","stars":5,"date":"2015-05-29","text":"I have been here multiple times and I always ask for Jimmy - he is always good!  This last visit, I asked him to do an ombré effect - but with no glitter.  He was hesitant since he hasn't done it using regular gel polish and it was such a big to do all over the salon - the owner John was very accommodating with my request.  Finally - jimmy got down to it and boy did he nail it!  This is the happiest I have been with my nails in a long time!  jimmy and I are so excited that we are already planning our next color combination.  If you want Ombré - Jimmy is your guy!","useful":0,"funny":0,"cool":0},
{"review_id":"VVf2zrQXumIvNNimRhZhIQ","user_id":"Wpr_EbRY9ABBnqrHS0Ad2A","business_id":"WlBvw6R1Qe2yIaZp-2ilZA","stars":1,"date":"2014-11-09","text":"The worst service - so slow - over 5 minutes just to get a menu, another 5 to get drinks then another 15 just to get food.  Oh wait we never got our food because the server said I had to be patient (translation: you're going to get your food whenever its ready).  We finally walked out since we never got anything.  Never again","useful":2,"funny":0,"cool":0},
{"review_id":"YFanm5Bf3KPvDB5QmyAcvw","user_id":"Wpr_EbRY9ABBnqrHS0Ad2A","business_id":"dk1MV0MP32Xq-iBxzewl0A","stars":1,"date":"2014-05-31","text":"Amazing - the slowest service EVER.  Great smoothies - but the worst service.  Waited 12 minutes for ONE drink.  CRAZY! Absolutely no urgency - management seriously needs to improve on the way they do business.  Unacceptable.","useful":0,"funny":0,"cool":0},
{"review_id":"lWgG73Gf79zW0k1F9B390g","user_id":"Wpr_EbRY9ABBnqrHS0Ad2A","business_id":"qKn9nynsVYIST8rf6tEFRQ","stars":5,"date":"2013-12-17","text":"Holy smokes - this place is great.  The pad seew, the garlic beef and tom yum is soooo good!  My husband also said that this is one of the best Thai places we have been to.\n\nI picked up our order and we ate at home and had no leftovers because every bite was divine!  \n\nI am so glad I found this place - it is simply the best Thai food in the area!","useful":0,"funny":0,"cool":0},
{"review_id":"BVB2J_gGgkWR-Vrd7UojXQ","user_id":"Wpr_EbRY9ABBnqrHS0Ad2A","business_id":"DDAGwRR0SypD47XD7-ytjA","stars":1,"date":"2016-04-09","text":"I'm writing solely about the customer service.  I called in a pick up order and they said you can come pick up in twenty minutes.  So I did come in after 20 minutes and when I entered the restaurant there were already 8 people waiting for their pickup order and I guess they still haven't picked up their order yet.  So it's been 35 minutes and I still haven't pick up my order yet and the others haven't either.  This is pretty bad - the waitress is useless too.\nI'm hoping the food is good.  I'm waiting 5 more minutes","useful":0,"funny":0,"cool":0},
{"review_id":"btFRFc-y2qMqH0aLBAxKig","user_id":"Bjo-p4SaDQ37H-Lq83gwkQ","business_id":"kNTOkEtBVW14RpFEUREzEw","stars":4,"date":"2011-03-19","text":"Don't judge this restaurant by it's semi-cheesy name... It's authentic greek and so very good. Good service. Great food. Highly recommended!","useful":1,"funny":0,"cool":0},
{"review_id":"7AsaRm03HpWH8KDaueRA0w","user_id":"fNrq5Utr7JmSwhgFc_R6Dg","business_id":"5kafliYagjermFOJEoaSYw","stars":5,"date":"2015-04-29","text":"I Love Love  Love this place!!! My husband picks up food from here twice a week and it is soo good.  I especially love their chicken yakisoba and California roll.  Plus the people that work here are super nice.","useful":0,"funny":0,"cool":0},
{"review_id":"qDnKYQoDchIsct95BKWfnA","user_id":"fNrq5Utr7JmSwhgFc_R6Dg","business_id":"ikaff3b56-CXzXADJ6uY6w","stars":5,"date":"2015-07-06","text":"This place is GREAT.  Whether it's your first time or you've been coming here for a while you will always feel welcome.  It says a lot about a place when you see a steady flow of regulars that come in day in and day out.  Home cooking at it's best!!!  Been coming here for years and don't plan on stopping anytime soon. Great food served in a family friendly environment!!!","useful":0,"funny":0,"cool":0},
{"review_id":"BEnqDB1JiLzF-GXQEqHqrg","user_id":"fNrq5Utr7JmSwhgFc_R6Dg","business_id":"rPk01P-gHFZnBtRyfc7Wrg","stars":5,"date":"2015-07-06","text":"One word best describes this place.  DELICIOUS!!!  My husband recently picked up some food to go from this place and I absolutely loved it.  Authentic Mexican food at its best!!!  Been back a couple of times since and everything has been excellent!!!  Will definitely be frequenting this place whenever I'm craving Mexican food.","useful":0,"funny":0,"cool":0},
{"review_id":"XUyx906qCSwIerkURtV6VQ","user_id":"F9M-6Hf1hCxUpYoUUPglKQ","business_id":"3trdX3B7ZwmO2SKpQ9UJrg","stars":5,"date":"2016-01-23","text":"Duh-licious! Have to try the One Red Door Burger... One of the best burgers I've ever had.","useful":0,"funny":0,"cool":0},
{"review_id":"LoNWfaFzKYADOP2-d19nTg","user_id":"bdLGgf9fGbNIneJ-jofevA","business_id":"_5WBxyToueeux24mj9TbpA","stars":5,"date":"2017-10-07","text":"Courtney has been a fantastic and patient swim instructor for my 4 year old. She had lots of knowledge of different swim tactics and makes it fun.","useful":0,"funny":0,"cool":0},
{"review_id":"-MQ7kzAQL0UrFqfCwvskjA","user_id":"CvnY8O7rJ67PTPBiZeubtw","business_id":"Ehy00JWQixgoXzisVKhvag","stars":5,"date":"2017-10-04","text":"Tony and staff was superb. Meal was excellent! It is in city center, and a easy short walk from Aria","useful":0,"funny":0,"cool":0},
{"review_id":"pnUw-dimyv_ZQS9JyKOccw","user_id":"zmxAHJ6QuX5m8h71M0uvNg","business_id":"E62l6LwZJ7lKaExcUbrtYw","stars":1,"date":"2013-12-01","text":"Service is really bad..... we had all u can eat but they limit our order and they gave us a look because we want to order sashimi ....n said there is no miso soup but they gave it to other ppl... the oyster are not fresh I had a stomach ache after... and 18% tips a mandatory but the service is really bad im so dissapointed it was pretty good before but I guess it changed because maybe its a different owner now... really dont recommend this place!!! Watch outtt don't want all of you to have a bad experience...\n\nPs.... btw the oyster and the shell doesnt make sense I think they save up the oyster shell and put can osyter in it ..... because the oyster the oyster doesnt stick to the shell the shape doesnt make sense too","useful":2,"funny":0,"cool":1},
{"review_id":"OU-j9KaKWt7HpEJY_8Q04Q","user_id":"sO0gifSMr9ZujlKFywkK9g","business_id":"JePAAhbOLBDI74VeePOBKw","stars":2,"date":"2014-11-15","text":"We ordered the basil pesto chicken pizza. Flavor wise it was okay. The main turn off how how greasy the base was. My hands were coated with grease and afterwards my mouth felt all greasy.","useful":2,"funny":0,"cool":0},
{"review_id":"1-gQNMi-xvvQXxc7DmbMKw","user_id":"TPvMatuTnRq_0sO4OQ6bHg","business_id":"IdUnbm1sMfdOFaXuCtkStg","stars":2,"date":"2016-10-28","text":"I was really excited about this place as a name like Potbelly and the nice decor suggests to me that you'll get some unique sandwiches with rich flavors. To my surprise, all i found was a glorified Subway. The vibe is nice by a real bummer when it comes to the menu or flavors.","useful":3,"funny":0,"cool":0},
{"review_id":"mMjST8rAN2k_rtzJTR8Ucw","user_id":"TPvMatuTnRq_0sO4OQ6bHg","business_id":"2zkMnvtLRvnSeHqVb96ung","stars":2,"date":"2016-10-28","text":"My wife and I were very excited to try Fired Up since it opened. We made our reservations for 7:30pm and showed up on time on a Saturday night. As we entered we noted the great energy and decor. This is where it started to go downhill. We saw a long line of people and thought well we're glad we have reservations! We were told that our table will be ready 'shortly' and that there was no place for us to wait in the restaurant and that we have to wait outside (in the cold) or go for a drink elsewhere while we wait. We got to learn that everyone waiting actually had reservations! They over booked the place! What upset me was that at 8pm another party who seem to know the owner had a reservation at 8 and were seated right away with complete disregard to us and everyone who's been waiting for a long time. That was totally rude. After waiting for about 45mins, we get a table. \n\nThe food menu is limited but interesting. We ordered the garlic bread as an appetizer and it was good. The mains were a big problem. My wife had the grilled swordfish, which was stone cold when served. I don't mean room temperature, I mean 'straight out of the fridge' cold. I ordered the venison chops which were bland and undercooked (served room temperature - I'm being generous). \n\nOverall the vibe is nice but the way we were treated was not welcoming at all and the food was mediocre at best. At these prices, we expect more. The only salvation for that place was our fantastic waiter, Tom, who was very friendly and personable. \n\nAn overpriced, mediocre experience.","useful":0,"funny":0,"cool":0},
{"review_id":"tH9e1KJE1rMI--nO2owohw","user_id":"GDGzGZ7tA7WHGxb5hxPHWg","business_id":"JkT6AqaYPsc3z2SXePxP5A","stars":1,"date":"2012-01-14","text":"I will not be going back..I was trying to enjoy my $ 10.00 hamburger at the bar, but kept being aggravated by no less than 4 patrons who were very offensive. They were not eating, just drinking. \n\nManagement did not even attempt to contain the idiots.","useful":1,"funny":0,"cool":0},
{"review_id":"Gs_Hzenq8DdVw2cya-i2XQ","user_id":"Hpu-ZChe7mijo4FxBXeiiw","business_id":"c-Ur4wPDNjt-e2N5MkRRaQ","stars":4,"date":"2014-10-31","text":"Stumbled in here one Saturday night for their all day dim sum. \n\nHighlights were cheap tea (4 - 5 kinds) which was frequently re-steeped, mango pudding and sesame ball desserts, and the decor. I can't say I've had better dim sum desserts than at Cha Lau! Some of the entrees were so-so, I wasn't a fan of some of the dumplings (the chive and pork one comes to mind) but definitely would recommend this place for the sesame balls alone. I don't even like black sesame but ordered two of the balls because they were so good. \n\nCheck them out!","useful":0,"funny":0,"cool":0},
{"review_id":"f4C_1tlTOb5snYC5Wr5hgQ","user_id":"Hpu-ZChe7mijo4FxBXeiiw","business_id":"buMP3nR_-EL2ROE7nKMBUg","stars":5,"date":"2014-07-27","text":"I've now been to Wafflian several times (get their frequent customer Waffle card! 1 stamp for every waffle purchased) and have enjoyed it each trip.\n\nI've had at least 4 kinds of cupcakes (double chocolate, green tea & cheesecake, peanut butter & banana, oreo cookie to name a few) tried both kinds of waffles, a snowflake and a coffee. \n\nCupcakes = I am extremely picky about cupcakes, buttercream or bust kind of gal, and I greatly enjoyed all of the cupcakes. The cake is crumbly, moist, and the buttercream is wonderful. I especially loved the green tea and cheesecake one. I had read the cupcakes were not good, but perhaps a change has been made recently? \n\nWaffles = COME HERE FOR THE WAFFLES! Fantastic, small enough for a snack, with fresh whipped cream and fruit, yum. Liege and brussels, I can't pick a favorite. Made fresh for every order. Also excellent with ice cream on top. The fruit is always arranged beautifully, like artwork. Some places just slap their toppings on your dish but I can tell care is taken with each order. \n\nSnowflake = I was wary at first! Tried a red bean one, and really liked it! The condensed milk adds some sweetness, and the red bean paste adds another layer of sweet texture. Great for a hot weather drink.\n\nCoffee = So-so coffee. \n\nDecor\/Atmosphere = Very cute, bright interior with friendly employees. The lighting is especially cool. Always clean, lots of forks, napkins, etc. Employees seem genuinely pleased to serve you.\n\nBonus = $1 bottle of water! \n\nOverall = I wish this was closer to my place! I love coming here for a sweet, affordable snack. Can't emphasize enough, try those waffles! So good.","useful":2,"funny":0,"cool":1},
{"review_id":"UKj0lCCHw061sQRkHBE-rw","user_id":"Hpu-ZChe7mijo4FxBXeiiw","business_id":"INRkSdAPW2WUjVSdEPZa8A","stars":5,"date":"2014-10-31","text":"I've tried a couple thai places in the area, and Papaya is the best.\n\nI am addicted to their thai dumplings, and spicy peanut chicken with crispy spinach (their peanut sauce is amazing, I lick the plate. Don't judge me).\n\nTheir duck entrees are delicious, the duck is cut beautifully, with crispy skin. Portions are not skimpy, which usually happens when you order a duck entree. \n\nHighly recommend!! Tucked in right next to the LCBO.","useful":0,"funny":0,"cool":0},
{"review_id":"BXzmt0az-8aznuIQBiUApA","user_id":"Hpu-ZChe7mijo4FxBXeiiw","business_id":"T-a4HuTSELZ3qm_nos_Qtg","stars":3,"date":"2014-10-07","text":"Been here twice, both times the service was slow. \n\nThe deli sandwiches are great, but my eggs benedict had a solid yolk and was swimming in overly salty hollandaise.\n\nBreakfast special is a good deal, but other food it hit or miss. Worth a try.","useful":1,"funny":0,"cool":0},
{"review_id":"8_h9afYCcatZ3Tb-qDfDHQ","user_id":"Hpu-ZChe7mijo4FxBXeiiw","business_id":"C_VoO9M9Kuhn6EObmpvWow","stars":4,"date":"2014-07-27","text":"Very happy to see a new burger place open up. \n\nUsed to be a Hero burger customer, but Slab burger has won me over! (Hero fries are slightly better, more crispy...) \n\nSlab burgers are very similar to Five Guys Burgers in the States. Thin, smashed patty, sesame seed bun, unlimited toppings. I always get the single cheeseburger, my boo gets the double cheeseburger with bacon and we share fries. Slab's better at the burger\/bun\/toppings ratio than the comparable Hero Burger down the street. \n\nHope it sticks around long enough for me to try the onion rings and poutine!","useful":0,"funny":0,"cool":0},
{"review_id":"n380S-LLKIH_mQ9L-kAKiw","user_id":"lrOGvsb8rFCdtbK1Ci3xPA","business_id":"gogO5RF4Rqz2THF1ATcCew","stars":5,"date":"2016-07-02","text":"We went to kabuki for our 25th wedding anniversary dinner. Not only was the food delicious, the service was wonderful, and they treated us to a complimentary dessert. Will definitely be going back and recommending. Great sushi!","useful":1,"funny":0,"cool":0},
{"review_id":"3M84Bh6y4fj-4cYGwLMi6w","user_id":"lrOGvsb8rFCdtbK1Ci3xPA","business_id":"BD-OOJ8PXSpYTgTHHhXt3g","stars":5,"date":"2016-07-23","text":"First Watch has delicious food, great service, friendly staff and nice environment. Try it, you'll like it! Kudos to Tina and Ian!","useful":0,"funny":0,"cool":0},
{"review_id":"I1gRqERmVDfuM6CKdGFCLw","user_id":"q-dGzZgX0A6f-4GhkASdPw","business_id":"AUoweFatsxUoZylBVMP3AQ","stars":4,"date":"2014-05-03","text":"Pretty good! Would stick to Mediterranean food only. We tried the hummus along with some other dips and they were good! Fresh tabouli was a plus. \n\nMy sister had the Bliss Burger and loved it! I thought my chicken shawarma was okay.","useful":5,"funny":0,"cool":0},
{"review_id":"6F4uA6iOr8zGTuF8HTt54Q","user_id":"QiIkEiMlbWUr4lexHImx6A","business_id":"VRTQMh7wVgmzg96YttL3mQ","stars":5,"date":"2017-04-10","text":"Great place! Cold beer, great cheeseburgers and wings. Our bartenders name was Steve. Very knowleagable. The tv's in this place would make it great for football. I'll be back no complaints here.","useful":0,"funny":0,"cool":0},
{"review_id":"Z7eCyIHdaHZQgEWzjRi5bw","user_id":"vzEQOhLMrdsOxyBEi3Gt_w","business_id":"trKyIRyjKqVSZmcU0AnICQ","stars":2,"date":"2016-07-04","text":"I usually do not write reviews. However,  had to write write about this place because the food is really good. Service is really bad. Had to ask the waitress for anything at least three time before she could actually remember and bring it. A couple at the table next to ours was asked how their food was and is they are ready for the check after an hour of waiting, when their food did not even come out. Just a heads up to the owners, could beg rest place if you hire good staff.","useful":0,"funny":0,"cool":0},
{"review_id":"1Ht8MiPvhH0CU5AfRCOA7A","user_id":"_sMJCO03E2bC6u1L-VewnA","business_id":"IWN2heYitkg-D4UdqfxcMA","stars":5,"date":"2017-10-14","text":"Taylor and Abraham were amazing. So much fun and the food was amazing!!! The Benedict was awesome and loved the mimosas.","useful":0,"funny":0,"cool":0},
{"review_id":"tZSAvK8w2pQQjKqst2phnw","user_id":"AwUSvEbQf7VPxcgCmmWZSg","business_id":"pGVID7WdLRCrJD3tQ2A13A","stars":1,"date":"2015-03-13","text":"Rudest customer service ever. DO NOT USE. I took a dress there to have the straps adjusted. They did no work to the dress and tried to claim that they had altered it. When I asked them to rejoin and fix it they became harassing and rude and called me fat. I left with my dress and a rude man called me multiple times and harassed me from their \"head office\". Disgusting behaviour. Waste of time and money. Do yourself a favour and find somewhere else.","useful":0,"funny":0,"cool":0},
{"review_id":"2TuvWyaGpIfxUIDGGcqE9Q","user_id":"dziQBccjHGsy926-LoZnwQ","business_id":"0y51pd3UjmtRR8jGODL-Pg","stars":5,"date":"2012-05-20","text":"We decided to try it after receiving the flyer in the mail. I called ahead and it was ready when I arrived to pick it up. The owner and son where great and even gave me the nutritional information flyer when I mentioned that I was losing weight but decided to splurge. To my surprise the deLite Mediterranean was not a diet buster. I also picked up the Cinnamon Wheel. \n\nThe Pizza was awesome! My husband said \"This is really good, I think we will try another kind tomorrow.\" As for the Cinnamon Wheel it exceeded my expectations and taste like a Cinnabon. Ten times better than the Cinnapie (At Papa Johns).\n\nI will be going back! FYI it is a Take-n-Bake restaurant, which means they build it and you bake it! Love them!","useful":5,"funny":0,"cool":1},
{"review_id":"OIGpz_6W6_BqrCBUWoN-lA","user_id":"SHC3_NEca0rKfZhuKa43Sg","business_id":"eoHdUeQDNgQ6WYEnP2aiRw","stars":3,"date":"2016-03-10","text":"It's good, if your staying near or walking by on the strip it's ok to eat at.  Interesting food but it's definitely average at best.  Today they were out of Bloody Mary mix.... It's Vegas, how are you out of Bloody Mary mix in the morning?  Food was a bit salty but the staff were nice.  It's definitely touristy so it about met expectations.","useful":0,"funny":0,"cool":0},
{"review_id":"YGG1lDjOhkwblkpMlwV8vQ","user_id":"V7MYhZOgLww_FRvBMnMQFA","business_id":"PNbX4mT6krRy_I0il8Il4Q","stars":5,"date":"2015-06-20","text":"This place is fantastic! Fast, friendly and honest. The honest part is a rarity these days, as I have been burned by so many mechanics in the past. \n\nI came initially just for an oil change and tire rotation, but had some questions about other repairs that were approaching their time according to my vehicle service maintenance guide. They did an inspection in the same visit and told me everything was tip-top and that I didn't need to rush any other maintenance. They also didn't try to upsell me on anything else! That was truly refreshing! I can't even tell you how many times I've been pressured into buying unnecessary upgrades or add-ons. \n\nAll this in under an hour! I am so happy to have found Crawford's! This will now be my go-to place for any of my vehicle needs. Thanks guys, keep up the great work!\n\nFunny side story:\n\nWhile I was waiting for my car to be serviced, there was an older gentleman there that was also waiting for his vehicle to be serviced. I overheard him talking and realized he was on a first-name basis with the owner and other staff. He was cracking jokes with them and had an overall relaxed demeanor like he had been there many times. So, I asked him if he was a long-time customer and if he was happy with the service. He leaned over and in all seriousness told me he has been coming to this shop since it opened and he refuses to go anywhere else. He told me Jeff (the owner) is \"like a savant\" when it comes to engines and cars in general. He said he has never seen anyone troubleshoot issues with cars like Jeff and he trusts him exclusively with all his vehicles - cars, motorcycles, boats and even airplanes! That's one hell of an endorsement! Shortly after he leaned back on the couch he was sitting on and passed right out! Homeboy was straight sawing logs! Hilarious.","useful":1,"funny":1,"cool":1},
{"review_id":"Xg4pxYXodbXLCBpa1wDXhg","user_id":"V7MYhZOgLww_FRvBMnMQFA","business_id":"EfakNfJNKjDprR03tTug0A","stars":1,"date":"2015-09-07","text":"I cannot in good conscience recommend this place to anyone. \n\nThis was my second and last time coming here. \n\nThe whole operation just feels shady. From the annoying greeters\/salesguys that try to pressure you into upgrades on services, to the blasé cashiers inside, to the dubious characters doing the actual cleaning... I'm not exactly sure why I came back again.\n\nThis outing went like this: Spent 15 minutes haggling with a guy who barely spoke English and called me \"buddy\" about 20 times while sweating my balls off in the Arizona sun. By the time we settled on a price, I was already exhausted and regretting my decision. I went inside to pay and the cashier girl barely looked up at me. The only word she managed to squeeze out was, \"Receipt?\" I gave her my receipt and payed. I then asked her two simple questions: Who is the owner of this place? And, how long will my service take? To the first question she just shrugged and make a quizzical face. To the second she said, \"A while.\"\n\nIt took a couple of hours. \n\nWhen they finally called me to say my vehicle was ready, the guy that walked me over to where it was parked seemed to linger. He didn't hand me my keys right away. I'm not sure if he was expecting a tip or something, but I had no intention of giving him one. I already overpaid for the service,  anything extra was out of the question. I said, \"Thank you,\" and put my hand out to get my key. He handed it over, but gave me a weird look. I got in and took several minutes readjusting my seat, which I told them not to mess with. \n\nAs I was leaving, I noticed a black and red truck whip out right behind me as I got onto the street. It followed me real close, like, right on my ass close. It followed me on the surface street, it followed me into some random residential neighborhood I turned into. This went on for a while, but after about 5 minutes of riding my ass going 15 MPH, the driver of the truck slammed on the brakes, made a violent U-turn and sped off.\n\nLike I said, SHADY.","useful":3,"funny":0,"cool":0},
{"review_id":"Ed1uHAlLUqrwtFRzoTJSBQ","user_id":"V7MYhZOgLww_FRvBMnMQFA","business_id":"DuIWM918-RdAA9szapc_Gg","stars":3,"date":"2015-07-04","text":"I initially called their main line listed for quotes on their website - 480-833-1111 - and spoke to Irene. She was fantastic! Great customer service. But, apparently I called the wrong office. They did not service my area. So, I was given the number to another office and told that she would pass my request and information to Karl, the manager of that location. She said Karl would follow up with me within the hour to schedule the appointment. Karl did not. I called and left a few messages before he called me back to hash out the details. \n\nI just wanted a basic spray down, inside and outside of my home. Nothing toxic. I did not have an infestation or a major problem, but did notice increased insect activity. \n\nThe service tech came out early and called beforehand, but his visit felt rushed to me. Yes, it's hot outside. It's Arizona during the summertime. I get all that. But, I was hoping to be educated about the whole process a little bit. When I initially set up the appointment I asked for a seasoned exterminator as I had just purchased my first house and wanted someone that could come out and identify any trouble areas and offer suggestions how to resolve them. I believe the guy that came out was named Bobby. He worked quickly and was done in less than 30 minutes. When he left, I didn't feel like I had a better understanding of what to look out for or how to treat it. We did briefly discuss the fact that I needed some cracks to be sealed and caulked inside and outside the house. He took down my email address and said he would get me a quote or a referral in a few days. It's been over a week now and I have not heard back. \n\nI didn't sign a contract, but I did preset another visit next month for an additional exterior spraying. I'm going to make sure I can be there the day they come out so I can pick the technician's brain a bit.\n\n7\/13\/15\n\nI decided to go another route for my pest control needs and canceled the visit scheduled for next month.","useful":2,"funny":0,"cool":0},
{"review_id":"JcgolVogK4GbtRg-wtnY5w","user_id":"V7MYhZOgLww_FRvBMnMQFA","business_id":"sKWZ_tAOVMZoC4Qk8_Bd4A","stars":5,"date":"2012-04-10","text":"Otto's is the mad notes! This is a local favorite and rightfully so. The man that runs the joint used to be a pastry chef (so the story goes), so you know to expect excellent homemade dough. The pizza pie, calzone and pizza roll crust are all fantastic. I never thought the best pizza in my 'hood would be made by a French guy, but it is a stone cold fact. The man knows his business and does it right on a consistent basis. \n\nOver the 10 or so years I have been coming here, I have tried just about everything. Pizza by the slice, entire pies, sandwiches, salads and pasta. The spaghetti here is amazing, especially if you get it with their giant homemade meatballs. Sweet Jesus, I would punch a baby in the face for a plate of it right now! And then I would punch the baby again for crying and trying to ruin my meal. Stupid baby, get to Otto's and get with the program. \n\nDid I mention their portions are huge? They are indeed generous. You certainly get your money's worth. \n\nThe only bummer is that they are closed on Sundays.","useful":6,"funny":6,"cool":5},
{"review_id":"Av8x_GHx1S5x4VOht3rb0w","user_id":"ybruBFtPgmmAGT4KFuLRyw","business_id":"gPSUFlB07XnzCwzPMNnHqA","stars":5,"date":"2014-07-23","text":"Recently had my \"07 Toyota Tacoma involved in an accident and had it taken to Capitol Collision for repairs.  They did an outstanding job of repairing my truck..!!  Further they were able to save me approximately $ 400.00 on my deductible.  My truck looks and runs like new. Amazing Job.., Kudos..!!","useful":0,"funny":0,"cool":0},
{"review_id":"e0UHPpbVYvLZwE2SfFz_jA","user_id":"ybruBFtPgmmAGT4KFuLRyw","business_id":"XCxu7JetC-rJz59QnwRVaA","stars":4,"date":"2015-01-20","text":"Triple A, has been AWESOME..!!  They have Bailed me out numerous times, and without costing me a fortune...  They diagnosed what I thought was a blown head gasket, as simply a spark plug that came out of its socket..!! .  Which means what I thought was going to be a $1000.00 repair, cost me $55.00..","useful":0,"funny":0,"cool":1},
{"review_id":"mE_-104nrEo-daZt4QWIXg","user_id":"9r4YdQZt__3N0-VJRjKMuw","business_id":"IS_IWMsFRJii__17LsP1Og","stars":5,"date":"2016-06-08","text":"Very freindly and helpful employees\nFoood  is always  on point best thai place around.","useful":2,"funny":0,"cool":2},
{"review_id":"HkH1DzmRmMA1ZwRVwOuh9Q","user_id":"B6eTHCX5EI6Xvo1_ZH8f2Q","business_id":"Sy6qv0jW0MJi68Ta2aZsjw","stars":1,"date":"2014-09-20","text":"I'll never take my car back there ever again! When they dry down my car I see nothing but lint all over also they didn't vacuum right the 1st time so I told him I still got grass in my car, as I was driving home I've notice my door wasn't clean also my windows wasn't clean in the inside. I've called talked to Ryan he said bring my car back and they can redo it which I did as I was watching this man dry down my car he used the same rag to clean my inside windows with no windex. When I got home I had to clean the window also used car cleaning products, sad part lint all over my car 2nd time.","useful":0,"funny":0,"cool":0},
{"review_id":"3-7g9rho-rrA06X14XQbow","user_id":"zaI8JiJN5lZoYEAxSS3H2g","business_id":"DDdX9rGk5v6OVoH9VMkk4w","stars":4,"date":"2011-10-26","text":"I love Best Wok II.  I think about the Triple Delight often.  Get the dinner special, which includes 2 crab rangoon and fried rice.  My husband likes the sesame beef.  It's so good!","useful":0,"funny":0,"cool":0},
{"review_id":"89WJpAe_D6uTh7J5Pr-rQw","user_id":"zaI8JiJN5lZoYEAxSS3H2g","business_id":"dgIRQ0lkPEE5JeacvBH3qg","stars":5,"date":"2014-04-19","text":"This company is great and trustworthy.\n\nThe two employees that came to my house were courteous and knowledgeable.  They arrived within the first 10 minutes of the hour window I was given.  They fully answered all of my questions and seemed to know exactly what they were talking about.  David, the employee who did the work inside my house, was friendly, funny, good with my 2 year old son, and quick with his work.  \n\nWhen I had an issue later that day I called in and was put in touch with the owner.  He spoke with David, and arranged a time for David to come out the next day.  They arrived, profusely apologized for the issue (which turned out to be a defect in the damper they had installed - not something they had done incorrectly), and made it right.  I really feel like they went above and beyond to make sure I was satisfied.  Even though David was not the owner, I felt like he apologized and took the blame better than any owner I've ever spoken to.\n\nI doubt you'll experience any issues with this company, but I can say that when I did, they did everything they could to make it right.  I am a satisfied customer, and would not hesitate to use them again, or refer them to my family and friends.","useful":2,"funny":0,"cool":0},
{"review_id":"Hyjt_Q9QIVqJWXqxvb0Xew","user_id":"lDc4MNgs6MyXofhc-U-IQA","business_id":"brVIRXT4AubkUbe6P-NAAA","stars":5,"date":"2015-01-26","text":"I celebrated my kids birthday last week (5 and 10 years) and the experience at OdySea Laser and Mirror Maze was fantastic.  The staff was attentive to our needs and requests during the planning stages as well as the day of the party.  My kids and their friends had a blast!  They could not get enough of both the laser and mirror maze.  Even the adults enjoyed their time competing for the best score at the laser maze.  The staff is very helpful and friendly and ensures you and your guests have a fun time.  We will definitely be going back to play again.","useful":1,"funny":0,"cool":0},
{"review_id":"BTybFeKw0fFEPOh9oxQyyg","user_id":"XDE_IeERew0YIbOkavb5dQ","business_id":"OVczZ1qHXc3bjDprNvCKBQ","stars":5,"date":"2015-10-22","text":"Anthony helped me out today, he is the best! I dropped my iPhone 6 and not only did the phone glass shatter but the screen had all these lines on it. I was so worried it was done for. They were able to fix my phone in just an hour and fifteen minutes. Their prices are the best around and their service is awesome.","useful":1,"funny":0,"cool":1},
{"review_id":"3STNnBEPuWo4JD_Xb8ya6A","user_id":"XDE_IeERew0YIbOkavb5dQ","business_id":"HHgRwkEJoj9EYqwNeggnzg","stars":5,"date":"2017-01-20","text":"I had been wanting to get my closet done for a long time. When I called Alfredo he measured my closet the next day and provided a great rendering SK I could see what it would look like. Install was fast and I am SO happy with my closet. It's gorgeous. They did an awesome job and Alfredo was great to work with.","useful":1,"funny":1,"cool":0},
{"review_id":"o6UrmpMyn-tBT3AUDrF1yQ","user_id":"XDE_IeERew0YIbOkavb5dQ","business_id":"fUKi8LlQhzsGntuZjfvLWg","stars":5,"date":"2015-06-10","text":"My boyfriend and I ate here this past Monday and it was a great meal. We typically go to Chinatown for dim sum and I'm so glad we have a place in Summerlin now. We had the Shu Mai, Chinese pancake, Gyoza, steamed dumplings and Taiwanese Dandan noodles. My boyfriend is half Taiwanese and he loved the Taiwanese specialties. Lisa the assistant manager was very helpful and kind. We will be back again.","useful":1,"funny":1,"cool":1},
{"review_id":"gyzZcIrdt9pRJh5mLc92LQ","user_id":"XDE_IeERew0YIbOkavb5dQ","business_id":"vbpFWZE2CtP_rMHr_FtUcA","stars":5,"date":"2015-10-15","text":"Richard is the best! He was very friendly and helpful. I came in with a flat tire and was back on the road in less than an hour.","useful":0,"funny":0,"cool":0},
{"review_id":"qq4W2XoM5LH81Wb4xg4SWw","user_id":"XDE_IeERew0YIbOkavb5dQ","business_id":"TfUjb3W46kx1zW1dKQe7oA","stars":5,"date":"2016-10-06","text":"Love my new patio cover! JMAR was professional and gave us a great quote. It took the guys just 3 hours to install and looks amazing! I'm very happy.","useful":0,"funny":0,"cool":1},
{"review_id":"dKN6KBribTqig0h04LGrcw","user_id":"XDE_IeERew0YIbOkavb5dQ","business_id":"FqGu8_UGvRj4pN9siqlP5A","stars":5,"date":"2012-03-01","text":"Amazing service! Everytime my brows come out perfect and I am usually in and out within 10 minutes. I won't go anywhere else!","useful":0,"funny":0,"cool":0},
{"review_id":"sRwWQDjsn_CFxucmENBnww","user_id":"XDE_IeERew0YIbOkavb5dQ","business_id":"h72AsjSTT3dPzYejT57mdQ","stars":5,"date":"2015-11-05","text":"Sidney is an amazing trainer. He really cares about your progress and I love the workouts. They are challenging and I've learned from Sidney that I am much stronger and capable than I thought. Every day is different so you never get bored or into a routine. I've already seen difference in my body, my legs and butt are really toning up. I actually look forward to going working out everyday. The fact that I can walk in at anytime and start working out is awesome. The girls I've met are friendly and we are all in it together! Thank you Sidney for motivating me & helping me get healthy and fit! You are truly a master in your field.","useful":1,"funny":0,"cool":0}
]
